app/controllers/clinic_locations_controller.rb

  def index
    @clinic_locations = ClinicLocation.all
---
SELECT "clinic_locations".* FROM "clinic_locations"

  def create
    @clinic_location = ClinicLocation.new(clinic_location_params)

    respond_to do |format|
      if @clinic_location.save
---
INSERT INTO "clinic_locations" ("title", "address", "phone_number", "long", "lat", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_clinic_location
      @clinic_location = ClinicLocation.find(params[:id])
---
SELECT  "clinic_locations".* FROM "clinic_locations" WHERE "clinic_locations"."id" = ? LIMIT 1  [["id", 1]]