app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? AND "profiles"."id" = ? LIMIT 1  [["user_id", 1], ["id", 4]]
---
  	def edit
  		@user = current_user
  		@profile = @user.profiles.find(params[:id])

INSERT INTO "profiles" ("full_name", "username", "gender", "age", "phone_number", "about", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
	# listing = Listing.find(params[:listing_id])
	@user = current_user
	@profile = @user.profiles.new(profile_params)

	if @profile.save